Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.demo has been changed
~ resource "aws_s3_bucket" "demo" {
        id                          = "demo-bucket-ecd6e730a9"
        tags                        = {
            "Environment" = "Dev"
            "Modu"        = "Infra"
            "Owner"       = "Emer"
            "Purpose"     = "Msc"
        }
        # (10 unchanged attributes hidden)



      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # aws_s3_bucket_server_side_encryption_configuration.demo_encryption has been changed
~ resource "aws_s3_bucket_server_side_encryption_configuration" "demo_encryption" {
        id     = "demo-bucket-ecd6e730a9"
        # (1 unchanged attribute hidden)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
      - rule {
          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_user.demo_user will be updated in-place
~ resource "aws_iam_user" "demo_user" {
        id            = "demo-user_change_2"
      ~ name          = "demo-user_change_2" -> "demo-user_change_4"
        tags          = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_user_policy.demo_policy must be replaced
-/+ resource "aws_iam_user_policy" "demo_policy" {
      ~ id          = "demo-user_change_2:demo-policy" -> (known after apply)
        name        = "demo-policy"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::demo-bucket-ecd6e730a9",
                          - "arn:aws:s3:::demo-bucket-ecd6e730a9/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ user        = "demo-user_change_2" -> "demo-user_change_4" # forces replacement
    }

  # aws_s3_bucket.demo must be replaced
-/+ resource "aws_s3_bucket" "demo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::demo-bucket-ecd6e730a9" -> (known after apply)
      ~ bucket                      = "demo-bucket-ecd6e730a9" -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "demo-bucket-ecd6e730a9.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "demo-bucket-ecd6e730a9.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "demo-bucket-ecd6e730a9" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "Dev"
            "Modu"        = "Infra"
            "Owner"       = "Emer"
            "Purpose"     = "Msc"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "a0cce9520c14535d2ac8dc8c32dfb4b3e69d40f65976ba28b3a44ce863be03fb" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.demo_encryption must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "demo_encryption" {
      ~ bucket = "demo-bucket-ecd6e730a9" -> (known after apply) # forces replacement
      ~ id     = "demo-bucket-ecd6e730a9" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.demo_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "demo_versioning" {
      ~ bucket = "demo-bucket-ecd6e730a9" -> (known after apply) # forces replacement
      ~ id     = "demo-bucket-ecd6e730a9" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # random_id.rand must be replaced
-/+ resource "random_id" "rand" {
      ~ b64_std     = "7NbnMKk=" -> (known after apply)
      ~ b64_url     = "7NbnMKk" -> (known after apply)
      ~ byte_length = 5 -> 6 # forces replacement
      ~ dec         = "1017217757353" -> (known after apply)
      ~ hex         = "ecd6e730a9" -> (known after apply)
      ~ id          = "7NbnMKk" -> (known after apply)
    }

Plan: 5 to add, 1 to change, 5 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e91ed5f2a0de:4141/lock?id=emerfan%252Fmsc-ssa-iac-comparison%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 5 to add, 1 to change, 5 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
